beer_app/app/controllers/list_controller.rb

  def index
    @lists = Lists.all
---
SELECT "lists".* FROM "lists"

  def show
     @lists = Lists.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]